# WoodCurlyDistortionEnable Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
AdvancedWood..::..WoodCurlyDistortionEnable Property
AdvancedWood Class See Also
---
The property labeled "Enable distortion for wood secondary curly highlight" from the "AdvancedWood" schema.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public static string WoodCurlyDistortionEnable { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property WoodCurlyDistortionEnable As String
	Get
```

Visual C++
---
```text
public:
static property String^ WoodCurlyDistortionEnable {
	String^ get ();
}
```

# Remarks
This property is of type "AssetPropertyBoolean".
# See Also
AdvancedWood Class
Autodesk.Revit.DB.Visual Namespace